{
    "diario_evolucao": [
      {
        "data": "2025-05-01",
        "titulo": "Estrutura inicial do sistema de jornal",
        "descricao": "Definido o formato de armazenamento das notícias com pastas por data e arquivos JSON com IDs aleatórios. Layout estilo Pinterest decidido."
      },
      {
        "data": "2025-05-02",
        "titulo": "Desenvolvimento da Home.php",
        "descricao": "Criação de script PHP que lista todos os arquivos JSON da pasta 'Noticias' e exibe os blocos com título, imagem, resumo e autor."
      },
      {
        "data": "2025-05-03",
        "titulo": "Sistema de exibição de notícias completas",
        "descricao": "Criação da página 'noticia.php' que recebe ID e data via URL, localiza o JSON e exibe conteúdo completo da notícia (título, subtítulo, imagem, autor, parágrafos)."
      },
      {
        "data": "2025-05-03",
        "titulo": "Correção de bug em ambiente de produção",
        "descricao": "Erro ao acessar a página no servidor devido a diferença entre 'Noticia.php' e 'noticia.php' (case-sensitive no Linux). Corrigido padronizando nomes para minúsculas."
      },
      {
        "data": "2025-05-03",
        "titulo": "Boas práticas e segurança",
        "descricao": "Aplicadas validações de sessão, uso de htmlspecialchars, checagem de arquivos com file_exists, e planejamento para logs e permissões."
      },
      {
        "data": "2025-05-04",
        "titulo": "Sistema de Publicaçao de posts",
        "descricao": "Apos muinto tentativa e erro, consegui criar um sistema de publicaçao de posts, onde o usuario pode criar um post, e ele é salvo em um arquivo JSON na pasta Noticias."
      },
      {
        "data": "2025-05-04",
        "titulo": "Sistema de Visualizaçao de posts",
        "descricao": "Criei um sistema de visualizaçao de posts, onde o usuario pode ver todos os posts criados, e clicar em um deles para ver o conteudo completo."
      },
      {
        "data": "2025-05-04",
        "titulo": "Sistema de Visualizaçao de posts",
        "descricao": "Correçao de exibiçao! agora e usado links para acessar os posts, e o conteudo completo é exibido em uma nova pagina."
      }
    ]
  } 
  